Revit 2024 API
ExternalDataInstanceRemovingFromDocumentEventArgs.InstanceId Property
 The Revit id of the external data instance being removed from Revit document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId InstanceId { get; }
Visual Basic
Public ReadOnly Property InstanceId As ElementId
	Get
Visual C++
public:
property ElementId^ InstanceId {
	ElementId^ get ();
}
See Also
ExternalDataInstanceRemovingFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace